<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"http","label":"production","backend":"3ae8ecdffd3897350954517c9d58edc84b7900213241ef2cd643f84b7ae9da2f","plan_job_ref":"Job Cloudflare Infra #27 at https://github.com/SableClient/Sable/actions/runs/23098516983","plan_out_hash":"89cf117c2ac8638726bdaad375b5f1a79db41b26be5ba511333815248cfeb523","plan_hash":"bfc57d0c23deeb8f60118fe1fef3931065fcfcc698a11572d45c5cc40380a332","plan_text_format":"diff","version":"2.2.3"} -->
OpenTofu plan for __production__
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy.</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # cloudflare_worker_version.site must be replaced
-/+ resource "cloudflare_worker_version" "site" {
!~      annotations         = {
+           workers_message      = (known after apply)
+           workers_tag          = (known after apply)
!~          workers_triggered_by = "create_version_api" -> (known after apply)
        } -> (known after apply)
!~      assets              = { # forces replacement
!~          asset_manifest_sha256 = "5b04b47b9c24a7e5cabdbf6a19b19d3fe14f1f00541ed6ad579c3dad250f10ac" -> "4fb9e2587ed200d7042c494713dffb89b86cc5f4f2f5a3d63075827665d276cc" # forces replacement
!~          directory             = "/home/runner/work/Sable/Sable/dist" -> "/github/workspace/dist"
#            (1 unchanged attribute hidden)
        }
+       compatibility_flags = (known after apply)
!~      created_on          = "2026-03-14T22:35:25Z" -> (known after apply)
!~      id                  = "************************************" -> (known after apply)
+       limits              = (known after apply)
+       main_script_base64  = (known after apply)
!~      number              = 109 -> (known after apply)
!~      source              = "terraform" -> (known after apply)
+       startup_time_ms     = (known after apply)
#        (4 unchanged attributes hidden)
    }

  # cloudflare_workers_deployment.site must be replaced
-/+ resource "cloudflare_workers_deployment" "site" {
!~      annotations  = { # forces replacement
!~          workers_message      = "f80f2737de787f7f63c6f1d485411bd5b818695a" -> "fix: align workflows to v* tags and support manual release deploys"
!~          workers_triggered_by = "deployment" -> (known after apply)
        }
!~      author_email = "cloudflare@sl.sable.moe" -> (known after apply)
!~      created_on   = "2026-03-14T22:35:26Z" -> (known after apply)
!~      id           = "************************************" -> (known after apply)
!~      source       = "terraform" -> (known after apply)
!~      versions     = [ # forces replacement
!~          {
!~              version_id = "************************************" -> (known after apply)
#                (1 unchanged attribute hidden)
            },
        ]
#        (3 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Warning: Attribute Deprecated

  with cloudflare_workers_custom_domain.site,
  on main.tf line 41, in resource "cloudflare_workers_custom_domain" "site":
  41:   environment = "production"

This attribute is deprecated.

(and one more similar warning elsewhere)
```
</details>

:memo: Plan generated in [Cloudflare Infra #27](https://github.com/SableClient/Sable/actions/runs/23098516983)